# Generar archivo txt con todas las extensiones de VSC:
# code --list-extensions > extensions.txt

# Intalar con Powershell todas las extensiones de VSC sin tener en cuenta los #comentarios:
# Get-Content extensions.txt | Where-Object { $_ -notmatch '^#' } | ForEach-Object { code --install-extension $_ }

#Extensiones VSC:
alefragnani.bookmarks
andys8.jest-snippets
burkeholland.simple-react-snippets
cweijan.vscode-mysql-client2
dsznajder.es7-react-js-snippets
ecmel.vscode-html-css
emmanuelbeziat.vscode-great-icons
fabiospampinato.vscode-monokai-night
github.copilot
github.copilot-chat
github.vscode-github-actions
mhutchie.git-graph
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-es
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-wsl
ms-vscode.live-server
pmneo.tsimporter
redhat.java
redhat.vscode-xml
ritwickdey.liveserver
sohibe.java-generate-setters-getters
tomoki1207.pdf
usernamehw.errorlens
vinliao.fast-arrow
visualstudioexptteam.vscodeintellicode
vmware.vscode-boot-dev-pack
vmware.vscode-spring-boot
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscjava.vscode-spring-boot-dashboard
vscjava.vscode-spring-initializr
vscode-icons-team.vscode-icons
xabikos.javascriptsnippets
